<?php
$basePath = dirname(dirname(__DIR__));

$fh = fopen(dirname($basePath) . '/vote2022/raw/elections_areas.csv', 'r');
fgetcsv($fh, 2048);
$keys = [
    '村里長彰化縣彰化市下里' => '620ce0f1-b058-4a3c-8421-7f8cacb5b862',
    '村里長彰化縣彰化市磚里' => '620ce0f0-2754-4787-bf79-7f8cacb5b862',
    '村里長彰化縣彰化市寶里' => '620ce0ee-b0b8-4548-88df-7f8cacb5b862',
    '村里長彰化縣埔鹽鄉子村' => '6205383f-191c-4c56-9a3f-1619acb5b862',
    '村里長彰化縣埔鹽鄉瓦村' => '62053841-9284-4168-a721-1619acb5b862',
    '村里長彰化縣芳苑鄉頂村' => '6205388d-0350-4b3f-a903-1619acb5b862',
    '村里長南投縣竹山鎮硘里' => '620538cf-b1b8-4e60-9887-1619acb5b862',
    '村里長南投縣名間鄉下村' => '620538e2-d048-470a-9721-1619acb5b862',
    '村里長雲林縣麥寮鄉瓦村' => '62053987-14a0-47e6-90a2-1619acb5b862',
    '村里長雲林縣元長鄉瓦村' => '620539a3-0be4-4799-8863-1619acb5b862',
    '村里長雲林縣水林鄉瓊埔村' => '620539bf-b228-4178-af5c-1619acb5b862',
    '村里長屏東縣東港鎮下里' => '62053a89-6184-4202-a972-1619acb5b862',
    '村里長屏東縣里港鄉三村' => '62053ab9-5894-4f0b-acc6-1619acb5b862',
    '村里長屏東縣新園鄉瓦村' => '62053aed-710c-4f35-92ee-1619acb5b862',
    '村里長嘉義市西區磚里' => '62053ca5-be14-43c6-82ae-1619acb5b862',
    '村里長臺北市萬華區糖里' => '62053d1f-7dfc-4fc1-ab75-1619acb5b862',
    '村里長高雄市左營區北里' => '62053dd8-7b3c-4231-b679-1619acb5b862',
    '村里長高雄市左營區南里' => '62053dd8-9850-47da-9e76-1619acb5b862',
    '村里長新北市中和區瓦里' => '62053f7d-d80c-4ebb-8766-1619acb5b862',
    '村里長新北市中和區灰里' => '62053f8a-152c-4ff8-ac7a-1619acb5b862',
    '村里長新北市永和區新里' => '62053faa-946c-4b40-938d-1619acb5b862',
    '村里長新北市坪林區石里' => '620ce0fa-5ec4-437d-8a00-7f8cacb5b862',
    '村里長臺中市北屯區子里' => '620540f6-ff44-465b-a7a7-1619acb5b862',
    '村里長臺中市外埔區子里' => '62054169-7c84-4aae-838a-1619acb5b862',
    '村里長臺中市大肚區蔗里' => '6205417c-abe8-442c-85b3-1619acb5b862',
    '村里長臺南市麻豆區寮里' => '620541e1-76a4-487e-96b5-1619acb5b862',
    '村里長臺南市官田區南里' => '620541f4-d93c-441c-88a2-1619acb5b862',
    '村里長臺南市西港區林里' => '62054209-e530-472e-9f70-1619acb5b862',
    '村里長臺南市新化區' . json_decode('"\\ue000"') . '拔里' => '620ce0cc-d20c-4c55-b278-7f8cacb5b862',
    '村里長臺南市龍崎區石里' => '620ce0da-e6ac-46df-9856-7f8cacb5b862',
    '村里長臺南市安南區南里' => '620542ab-8228-4701-a3e6-1619acb5b862',
    '村里長臺南市安南區公里' => '620542b3-3c30-4469-af2d-1619acb5b862',
    '縣市議員宜蘭縣第11' => '631c9e17-fac0-42f3-98af-4f200a8c0008',
    '鄉鎮市民代表連江縣南竿鄉' => '62053692-858c-4ced-976f-1619acb5b862',
    '鄉鎮市民代表連江縣北竿鄉' => '62053694-5f20-474e-b117-1619acb5b862',
    '鄉鎮市民代表連江縣莒光鄉' => '62053696-570c-43b3-a5d7-1619acb5b862',
    '鄉鎮市民代表連江縣東引鄉' => '62053697-b5b8-4422-aea8-1619acb5b862',
    '鄉鎮市民代表金門縣金城鎮' => '62053699-5e00-4147-9353-1619acb5b862',
    '鄉鎮市民代表金門縣金沙鎮' => '6205369b-d0f8-40e2-ac84-1619acb5b862',
    '鄉鎮市民代表金門縣金湖鎮' => '6205369d-cf14-4c08-b32f-1619acb5b862',
    '鄉鎮市民代表金門縣金寧鄉' => '6205369f-cf18-4c6e-94db-1619acb5b862',
    '鄉鎮市民代表金門縣烈嶼鄉' => '620536a0-2e40-4e16-9173-1619acb5b862',
    '鄉鎮市民代表金門縣烏坵鄉' => '620536a2-92b0-42c2-800b-1619acb5b862',
    '鄉鎮市民代表臺東縣蘭嶼鄉' => '62053b8e-36f4-4066-b2d3-1619acb5b862',
];
while ($line = fgetcsv($fh, 2048)) {
    $parts = explode(' > ', $line[1]);
    array_shift($parts);
    $key = implode('', $parts);
    $key = str_replace(['選舉區', '選區'], '', $key);
    $pos = strpos($key, '[');
    if (false !== $pos) {
        $key = substr($key, 0, $pos);
    }
    $keys[$key] = $line[0];
}

$oFh = fopen($basePath . '/data/elections/2022.csv', 'w');
$headDone = false;
foreach (glob($basePath . '/data/2022/*.csv') as $csvFile) {
    $p = pathinfo($csvFile);
    $fh = fopen($csvFile, 'r');
    $head = fgetcsv($fh, 2048);
    if (false === $headDone) {
        $headDone = true;
        fputcsv($oFh, array_merge($head, ['election_id']));
    }
    while ($line = fgetcsv($fh, 2048)) {
        $data = array_combine($head, $line);
        $key = $p['filename'] . $data['area'];
        $key = str_replace(['選舉區', '選區'], '', $key);
        $data['election_id'] = $keys[$key];
        fputcsv($oFh, $data);
    }
}
